README.org
#+STARTUP: indent
#+TITLE: My configuration file for Emacs
#+AUTHOR: Mahito TANNO
#+DATE:
#+OPTIONS: H:2

* Quick start
#+begin_src sh :tangle no
  $ git clone --recursive https://github.com/mahito1594/dotemacs.git ~/.emacs.d
#+end_src

あるいは

#+begin_src sh :tangle no
  $ git clone https://github.com/mahito1594/dotemacs.git ~/.emacs.d
  $ cd ~/.emacs.d
  $ git submodule init
  $ git submodule update
#+end_src

とします．
初回起動時のパッケージインストールに時間がかかりすぎるという場合は
version lock file (~straight/versions/default.el~) を削除してから Emacs を起動してください．
shallow clone でパッケージをダウンロードします．

* Introduction
** init.el
~init.el~ は ~elisp~ を =load-path= に追加し， ~utility.el~ と ~my-init.el~ を読み込みます．
ただし Emacs のバージョンが古い場合はこれらは読み込まれません．

また Customize で設定したカスタム変数は ~.emacs.d/local-conf.el~ に保存されます．
ローカルに設定したい事柄は ~.emacs.d/local-conf.el~ に記述します．
これらは Git によって追跡されません．

起動時にガベージコレクタが走らないように閾値を下げます．
ただし，起動後には元々の値に戻すようにします．

** my-init.el
~my-init.el~ に個人的な Emacs の設定をまとめてあります．
Emacs バージョン 25.4 以降での利用を想定しています．
特にバージョン 26 以降での利用を強く勧めます．

設定を記述するにあたって，以下に強い影響を受けました．

- [[https://github.com/raxod502/radian/tree/develop/emacs][radian/emacs]] (by [[https://github.com/raxod502][raxod502]])
- [[https://github.com/seagle0128/.emacs.d][Centaur Emacs]] (by [[https://github.com/seagle0128][seagle0128]])

~my-init.el~ を編集する際は ~README.org~ を編集します．
編集後に =org-babel-tangle= を用いて ~my-init.el~ を生成します．

本設定ファイルで定義する変数や関数には ~my-~ というプレフィックスをつけることにします．

#+begin_src emacs-lisp :exports none
  ;;; my-init.el --- My configuration file for Emacs -*- lexical-binding: t -*-

  ;; Copyright (C) 2019  TANNO Mahito

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; `my-init.el' is my configuration for Emacs.  You can get details in
  ;; `README.org' or in `.emacs.d/doc/index.html' generated by Org-mode.

  ;; Do not edit this file directly.  If you want to edit `my-init.el',
  ;; you must edit `README.org' instead.

  ;;; Code:
#+end_src

** utility.el
変数・定数・関数のうち，いくつかは ~elisp/utility.el~ に抜き出します．
必要に応じてバイトコンパイルを行います．

#+begin_src emacs-lisp :exports none :tangle ./elisp/utility.el
  ;;; utility.el --- Some convenient functions for my Emacs configuration -*- lexical-binding: t -*-

  ;; Copyright (C) 2019  TANNO Mahito

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This file is tangled from `README.org'.

  ;;; Code:
#+end_src

** site-lisp/
いくつかのパッケージは ~site-lisp/~ 以下に配置して =require= します．
~site-lisp~ に配置するのは次の通り．

- [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]]

これらは git submodule で管理します．

まず ~site-lisp/~ 以下の全てのサブディレクトリを load-path に追加します．

#+begin_src emacs-lisp
  (defconst my-site-lisp-directory
    (expand-file-name "site-lisp/" user-emacs-directory)
    "We should put here packages.")

  (let ((default-directory my-site-lisp-directory))
    (add-to-list 'load-path default-directory)
    (if (fboundp 'normal-top-level-add-subdirs-to-load-path)
        (normal-top-level-add-subdirs-to-load-path)))
#+end_src

ログインシェルの環境変数を引き継ぎます．
変数 ~exec-path-from-shell-arguments~ から ~"-i"~ を取り除くと処理が早くなるようです．
Issue [[https://github.com/purcell/exec-path-from-shell/issues/36][#36]] [[https://github.com/purcell/exec-path-from-shell/issues/50][#50]] [[https://github.com/purcell/exec-path-from-shell/issues/75][#75]] を参照してください．

#+begin_src emacs-lisp
  (when (memq window-system '(mac ns x))
    (require 'exec-path-from-shell)
    (delete "-i" exec-path-from-shell-arguments) ; drop "-i" from option
    (exec-path-from-shell-initialize))
#+end_src

* Fundamental
** Variables
*** Init file and its document
#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (defvar my-locate-readme (expand-file-name "README.org" user-emacs-directory)
    "Place where `README.org' should be.")

  (defvar my-locate-init (expand-file-name "elisp/my-init.el" user-emacs-directory)
    "Place where `my-init.el' should be.")

  (defvar my-locate-utility (expand-file-name "elisp/utility.el" user-emacs-directory)
    "Place where `utility.el' should be.")
#+end_src

*** Backup file
ファイルを ~.emacs.d/backups~ 以下に自動保存します．

#+begin_src emacs-lisp
  (defvar my-backup-directory (expand-file-name "backups/" user-emacs-directory)
    "We save automatically files into the directory:
  We set `backup-directory-alist' and `auto-save-file-name-transforms' to `my-backup-directory'.")
#+end_src

*** Local configuration directory
環境・マシンごとの設定を ~.emacs.d/local-conf.el~ に記述します．
詳細は [[Local configuration][Local configuration]] を参照してください．

#+begin_src emacs-lisp
  (defvar my-local-config-file (expand-file-name "local-conf.el" user-emacs-directory)
    "You put Emacs Lisp files here for local config.")
#+end_src

** Functions
*** Edit init file
~README.org~ を編集するには ~C-x C-f~ で開くか ~M-x my-edit-init~ とします．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (defun my-edit-init ()
    "Open `README.org' to edit."
    (interactive)
    (find-file my-locate-readme))
#+end_src

*** Compile the configurations
~M-x my-make-config~ で ~my-init.el~, ~utility.el(c)~ を生成します．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (defun my-make-config ()
    "Make `my-init.el', `utility.el' and `utility.elc'."
    (interactive)
    (with-current-buffer (find-file-noselect my-locate-readme)
      (org-babel-tangle))
    (byte-compile-file my-locate-utility))
#+end_src

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (defun my-deploy-ghpage ()
    "Export \"README.org\" in order to deploy GitHub Pages
  via Travis CI."
    (let ((org-html-head
           "<link rel=\"stylesheet\" type=\"text/css\" href=\"style.css\">"))
      (with-current-buffer (find-file-noselect my-locate-readme)
        (org-html-export-to-html))))
#+end_src

** Package manager
パッケージマネージャとして ~straight.el~ と ~use-package.el~ を利用します

*** straight.el
[[https://github.com/raxod502/straight.el][straight.el]] は Emacs のパッケージマネージャの 1 つです．

#+begin_quote
next-generation, purely functional package manager for the Emacs hacker.
#+end_quote

~develop~ ブランチの ~straight.el~ をインストールします．

デフォルトのままでは Emacs の起動が遅くなるので ~straight-check-for-modifications~ を適当に設定しておきます．
現在のところ ~(watch-files find-when-checking)~ に設定するのがベストなようです．
そのためには Python3 と [[https://github.com/watchexec/watchexec][watchexec]] がインストールされている必要があります．
これら 2 つがインストールされていない場合は ~(check-on-save find-when-checking)~ に設定します．

また git を用いてインストールするパッケージについて [[https://github.com/raxod502/straight.el#git-backend][shallow clone]] するようにします．
ただしバージョンが固定されているパッケージについては shallow clone しません．

#+begin_src emacs-lisp
  (setq straight-repository-branch "develop") ; use the develop branch of straight.el
  (if (and (executable-find "watchexec")
           (executable-find "python3"))
      (setq straight-check-for-modifications '(watch-files find-when-checking))
    (setq straight-check-for-modifications '(check-on-save find-when-checking)))

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq straight-vc-git-default-clone-depth 1) ; shallow clone
#+end_src

*** use-package.el
[[https://github.com/jwiegley/use-package][use-package]] を用いてパッケージの設定を feature 単位で記述します．

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
#+end_src

keywords は次の順序で書くようにします:

- =:defines=
- =:functions=
- =:preface=
- =:if= (or =:when=)
- =:straight=
- =:load-path=
- =:commands=
- =:init=
- =:mode=
- =:interpreter=
- =:hook=
- =:hydra=
- =:bind=
- =:demand=
- =:after=
- =:custom=
- =:config=
- =:blackout= 

~:preface~ は ~:if~ 節の判定に関わらず読み込まれます．
他パッケージで定義される変数や関数を用いる場合 ~:defines~ や ~:functions~ に列挙しておくのが安全なようです．
基本的に ~straight.el~ を用いてパッケージをインストールするようにします．
また，パッケージは常に遅延ロードします．
遅延ロードをさせないときは明示的に =:demand t= を指定します．
遅延ロードの際， =:after= などのキーワードを併用する場合は注意が必要です．
[[https://jwiegley.github.io/use-package/keywords/#after]] を参照してください．

#+begin_src emacs-lisp
  (setq straight-use-package-by-default t)
  (setq use-package-always-defer t)
#+end_src

build-in の機能を用いるため ~use-feature~ マクロを定めます．
~use-feature~ は radian.el を参考にしました．

#+begin_src emacs-lisp
  (defmacro use-feature (name &rest args)
    "Like `use-package', but with `straight-use-package-by-default' disabled."
    (declare (indent defun))
    `(use-package ,name
       :straight nil
       ,@args))
#+end_src

** Some package
いくつかのパッケージを先にインストールします．
これは Emacs 同梱の (古い) バージョンのパッケージの読み込みを避けるためです．

*** Org-mode
2019年3月現在の ~straight.el~ ではデフォルトで最新の Org-mode をインストールすることができます．

#+begin_src emacs-lisp
  (straight-use-package 'org)
#+end_src

*** flymake
lsp-mode が flymake に依存しており，古いバージョンの flymake を読み込んでしまう恐れがあるようです．
回避策として lsp-mode を読み込む前に最新の flymake をインストールします．
詳細は [[https://github.com/raxod502/straight.el#faq][straight.el/FAQ]] か [[https://github.com/raxod502/straight.el/issues/355][straight.el/Issue#355]] を参照してください

#+begin_src emacs-lisp
  (straight-use-package 'flymake)
#+end_src

*** blackout
[[https://github.com/raxod502/blackout][blackout]] は deminish や delight のように，メジャー・マイナーモードのモードラインの表示をカスタマイズできます．

#+begin_src emacs-lisp
  (use-package blackout
    :straight (:host github :repo "raxod502/blackout")
    :demand t)
#+end_src

*** all-the-icons
いくつかのパッケージで ~all-the-icons~ のフォントを使用します．
フォントが未インストールかつ GUI で起動した場合，フォントを自動的にインストールします．

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (window-system)
    :demand t
    :config
    (unless (member "all-the-icons" (font-family-list))
      (all-the-icons-install-fonts t)))
#+end_src

*** Hydra
[[https://github.com/abo-abo/hydra][Hydra]] を利用してキーバインドを使いやすくします．
また [[https://gitlab.com/to1ne/use-package-hydra][use-package-hydra]] を用いて use-package のキーワードを追加します．

#+begin_src emacs-lisp
  (use-package hydra
    :demand t)

  (use-package use-package-hydra
    :demand t
    :after (hydra))
#+end_src

* Utilities
** Language, Codings
日本語かつ UTF8 を使用するようにします．

#+begin_src emacs-lisp
  (set-language-environment "Japanese")
  (prefer-coding-system 'utf-8)
#+end_src

また Linux 使用時は ~mozc~ を用いて日本語入力を行います．
別途 ~emacs-mozc-bin~ をインストールする必要があります．

#+begin_src emacs-lisp
  (use-package mozc
    :if (eq system-type 'gnu/linux)
    :demand t
    :config
    (setq default-input-method "japanese-mozc"))
#+end_src

macOS 使用時はファイル名の文字コードの問題があります．

#+begin_src emacs-lisp
  (use-feature ucs-normalize
    :if (eq system-type 'darwin)
    :demand t
    :config
    (set-file-name-coding-system 'utf-8-hfs)
    (setq locale-coding-system 'utf-8-hfs))
#+end_src

** Server
Emacs 起動後に =server-start= します．

#+begin_src emacs-lisp
(use-feature server
  :hook (after-init . server-mode))
#+end_src

** Restart
=M-x restart-emacs= で Emacs を再起動できるようにします．

#+begin_src emacs-lisp
  (use-package restart-emacs
    :commands (restart-emacs))
#+end_src

また [[https://github.com/jschaf/esup][esup]] を用いて Emacs 起動時間等の計測ができます．

#+begin_src emacs-lisp
  (use-package esup
    :commands (esup))
#+end_src

** Backup files
自動バックアップとオートセーブファイルを ~.emacs.d/backups~ に集めます．
~.emacs.d/backups~ は変数 =my-backup-directory= で変更できます．

#+begin_src emacs-lisp
  (setq backup-directory-alist
        `((".*" . ,my-backup-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,my-backup-directory t)))
  (setq auto-save-list-file-prefix
        (concat my-backup-directory
                "/.saves-"))
#+end_src

** Directories
