README.org
*** dired
~.~ を押下することで Hydra を用いた ~dired-mode~ の操作をできるようにします．

#+begin_src emacs-lisp
  (use-feature dired
    :custom
    (dired-recursive-copies 'always)
    :config
    (put 'dired-find-alternate-file 'disabled nil))

  (use-feature dired-x
    :hydra
    (hydra-dired
     (:hint nil)
     "
  ^Navigate^          ^Edit^            ^Mark^               ^Command^           ^Misc^
  ^^^^^^^^^^-----------------------------------------------------------------------------------------
  _n_: next           _+_: mkdir        _m_: mark            _Z_: compress file  _(_: details
  _p_: previous       _C_: copy         _u_: unmark          ^ ^                 _)_: hide some files
  _J_: up directory   _R_: rename       _U_: unmark all      ^ ^                 _g_: refresh
  ^ ^                 _D_: delete       _t_: toggle marks    _M_: chmod
  _f_: open file      ^ ^               _E_: extension mark  _G_: chgrp          _q_: quit window
  _v_: view file      _Y_: rel symlink  _F_: find marked     _O_: chown
  _a_: open in        _S_: symlink
  ^ ^    current buf  ^ ^               ^ ^                  _!_: shell command  _._: toggle Hydra
  "
     ;; Navigate
     ("n" dired-next-line)
     ("p" dired-previous-line)
     ("g" revert-buffer)
     ("J" dired-up-directory)
     ("f" dired-find-file)
     ("v" dired-view-file)
     ("a" dired-find-alternate-file)
     ;; Edit
     ("+" dired-create-directory)
     ("C" dired-do-copy)
     ("R" dired-do-rename)
     ("D" dired-do-delete)
     ("Y" dired-do-relsymlink)
     ("S" dired-do-symlink)
     ;; Mark
     ("m" dired-mark)
     ("u" dired-unmark)
     ("U" dired-unmark-all-marks)
     ("t" dired-toggle-marks)
     ("E" dired-mark-extension)
     ("F" dired-do-find-marked-files)
     ("Z" dired-do-compress)
     ("M" dired-do-chmod)
     ("G" dired-do-chgrp)
     ("O" dired-do-chown)
     ("!" dired-do-shell-command)
     ;; Misc
     ("(" dired-hide-details-mode)
     (")" dired-omit-mode)
     ("g" revert-buffer)
     ("q" quit-window)
     ("." nil))
    :bind (:map dired-mode-map
                ("." . hydra-dired/body))
    :demand t
    :after (dired)
    :custom
    (dired-omit-files "^\\.?#\\|^\\.$\\|^\\.\\.$\\|^\\..+$"))
#+end_src

~dired-mode~ の際，ファイルのアイコンを表示するようにします．

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :if (window-system)
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

*** neotree
ツリープラグインとして [[https://github.com/jaypei/emacs-neotree][neotree]] を用います．
~C-c t~ で起動します．
GUI での使用の際，all-the-icons を用いてアイコンを表示するようにします．

#+begin_src emacs-lisp
  (use-package neotree
    :bind (("C-c t" . neotree-toggle))
    :custom
    (neo-theme (if (display-graphic-p)
                   'classic
                 'arrow)))
#+end_src

** Candidates
*** Ivy, Counsel and swiper
補完インターフェイスとして [[https://github.com/abo-abo/swiper][Ivy/Counsel]] を利用します．
詳しい使い方は[[https://oremacs.com/swiper/][ユーザマニュアル]]を参照してください．

#+begin_src emacs-lisp
  (use-package counsel
    :hook ((after-init . ivy-mode)
           (ivy-mode . counsel-mode))
    :bind (("C-s" . swiper)
           ("C-r" . swiper)
           ("C-S-s" . swiper-all)
           ("C-c C-r" . ivy-resume)
           :map ivy-minibuffer-map
           ("<tab>" . ivy-alt-done)
           ("C-w" . ivy-yank-word))
    :custom
    (ivy-use-virtual-buffers t)
    (ivy-count-format "(%d/%d) ")
    (ivy-wrap t)
    (ivy-format-function 'ivy-format-function-arrow)
    (counsel-yank-pop-separator "\n<--------->\n")
    (ivy-initial-inputs-alist nil)
    :blackout t)
#+end_src

ivy-hydra を利用して minibuffer での操作性を向上させます．

#+begin_src emacs-lisp
  (use-package ivy-hydra
    :bind (:map ivy-minibuffer-map
                ("C-o" . hydra-ivy/body)))
#+end_src

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] を用いてバッファ切り替えの際などにアイコンを表示するようにします．
関数 =my-ivy-rich-buffer-icon=, =my-ivy-rich-file-icon= を定義し，バッファ切替時等にアイコンを表示するようにします．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  ;;; for ivy-rich: show icons
  (defun my-ivy-rich-buffer-icon (candidate)
    "Show buffer isons in `ivy-rich', only on GUI."
    (when (display-graphic-p)
      (with-current-buffer
          (get-buffer candidate)
        (let ((icon (all-the-icons-icon-for-mode major-mode)))
          (if (symbolp icon)
              (all-the-icons-icon-for-mode 'fundamental-mode)
            icon)))))

  (defun my-ivy-rich-file-icon (candidate)
    "Show file icons in `ivy-rich', only on GUI."
    (when (display-graphic-p)
      (let ((icon
             ;; for directories
             (if (file-directory-p candidate)
                 (cond
                  ;; for `tramp-mode'
                  ((and (fboundp 'tramp-tramp-file-p)
                        (tramp-tramp-file-p default-directory))
                   (all-the-icons-octicon "file-directory"))
                  ;; for symbolic links
                  ((file-symlink-p candidate)
                   (all-the-icons-octicon "file-symlink-directory"))
                  ;; for git submodules
                  ((all-the-icons-dir-is-submodule candidate)
                   (all-the-icons-octicon "file-submodule"))
                  ;; for version-controled by git
                  ((file-exists-p (format "%s/.git" candidate))
                   (all-the-icons-octicon "repo"))
                  ;; otherwise
                  (t (let ((matcher (all-the-icons-match-to-alist candidate all-the-icons-dir-icon-alist)))
                       (apply (car matcher) (list (cadr matcher))))))
               ;; for files
               (all-the-icons-icon-for-file candidate))))
        (unless (symbolp icon)
          (propertize icon
                      'face `(:family ,(all-the-icons-icon-family icon) :height 1.1))))))
#+end_src

#+begin_src emacs-lisp
  (use-package ivy-rich
    :functions (my-ivy-rich-buffer-icon my-ivy-rich-file-icon)
    :hook (ivy-mode . ivy-rich-mode)
    :custom
    (ivy-rich-path-style 'abbrev)
    (ivy-rich-display-transformers-list
     '(ivy-switch-buffer
       (:columns
        ((my-ivy-rich-buffer-icon :width 2)
         (ivy-rich-candidate (:width 30))
         (ivy-rich-switch-buffer-size (:width 7))
         (ivy-rich-switch-buffer-indicators (:width 4 :face error :align left))
         (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
         (ivy-rich-switch-buffer-project (:width 15 :face success))
         (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))
        :predicate
        (lambda (cand) (get-buffer cand)))
       counsel-M-x
       (:columns
        ((counsel-M-x-transformer (:width 40))
         (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
       counsel-describe-function
       (:columns
        ((counsel-describe-function-transformer (:width 40))
         (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
       counsel-describe-variable
       (:columns
        ((counsel-describe-variable-transformer (:width 40))
         (ivy-rich-counsel-variable-docstring (:face font-lock-doc-face))))
       counsel-recentf
       (:columns
        ((ivy-rich-candidate (:width 0.8))
         (ivy-rich-file-last-modified-time (:face font-lock-comment-face))))
       counsel-find-file
       (:columns
        ((my-ivy-rich-file-icon :width 2)
         (ivy-rich-candidate)))
       counsel-git
       (:columns
        ((my-ivy-rich-file-icon :width 2)
         (ivy-rich-candidate)))))
    :blackout t)
#+end_src

[[https://github.com/DarwinAwardWinner/amx][amx]] を用いて ~M-x~ を ivy と統合します．

#+begin_src emacs-lisp
  (use-package amx
    :hook (ivy-mode . amx-mode))
#+end_src

*** emacs-which-key
[[https://github.com/justbur/emacs-which-key][which-key]] を用いてキーバインドを表示させます．

#+begin_src emacs-lisp
  (use-package which-key
    :hook (after-init . which-key-mode)
    :bind (:map which-key-mode-map
                ("C-x DEL" . which-key-C-h-dispatch)
                ("C-c DEL" . which-key-C-h-dispatch))
    :custom
    (which-key-popup-type 'side-window)
    (which-key-side-window-location 'bottom)
    :blackout t)
#+end_src

** Navigation
=C-v= で =hydra-navi= による移動ができるようになります．

#+begin_src emacs-lisp
  (defhydra hydra-navi
    (:hint nil)
    "
  ^Navigate^              ^ ^                 ^Action
  ^^^^^^-----------------------------------------------------------
  _f_: foward char        _n_: next line      _s_: search
  _F_: foward word        _p_: previous line  _r_: replace
  _b_: backward char      _v_: scroll down
  _B_: backward word      _V_: scroll up      _k_: kill buffer
  _a_: beginning of line  ^ ^
  _e_: end of line        ^ ^                 _x_: execute command
  "
    ("n" next-line)
    ("p" previous-line)
    ("f" forward-char)
    ("F" forward-word)
    ("b" backward-char)
    ("B" backward-word)
    ("a" beginning-of-line)
    ("e" move-end-of-line)
    ("v" scroll-up-command)
    ("V" scroll-down-command)
    ("s" swiper)
    ("r" query-replace)
    ("x" counsel-M-x)
    ("k" kill-buffer)
    ("q" nil "quit"))
#+end_src

** Others
*** Parenthesis
対応する括弧類は自動的に挿入し，また強調するようにします．

#+begin_src emacs-lisp
  (use-feature elec-pair
    :hook (after-init . electric-pair-mode))

  (use-feature paren
    :hook (after-init . show-paren-mode)
    :custom
    (show-paren-style 'mixed))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Whitespace
基本的に，インデントにはタブ文字ではなく空白文字を利用します．

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

~C-c w~ で空白文字を可視化します．

#+begin_src emacs-lisp
  (use-feature whitespace
    :commands (whitespace-mode)
    :bind (("C-c w" . whitespace-mode))
    :custom
    (whitespace-style '(
                        face
                        trailing
                        tabs
                        spaces
                        empty
                        space-mark
                        tab-mark
                        ))
    :blackout t)
#+end_src

*** Cursor
[[https://github.com/Malabarba/beacon][beacon]] を用いてカーソルを目立たせます．

#+begin_src emacs-lisp
  (use-package beacon
    :hook (after-init . beacon-mode)
    :custom
    (beacon-color "yellow"))
#+end_src

*** Region
選択中のリージョンをハイライトします．

#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'transient-mark-mode)
#+end_src

*** Ring bell
エラー時のベル音を消します．

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
#+end_src

* Completion and syntax checking
** Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :blackout t)
#+end_src

