elisp/utility.el

;;; for ivy-rich: show icons
(defun my-ivy-rich-buffer-icon (candidate)
  "Show buffer isons in `ivy-rich', only on GUI."
  (when (display-graphic-p)
    (with-current-buffer
        (get-buffer candidate)
      (let ((icon (all-the-icons-icon-for-mode major-mode)))
        (if (symbolp icon)
            (all-the-icons-icon-for-mode 'fundamental-mode)
          icon)))))

(defun my-ivy-rich-file-icon (candidate)
  "Show file icons in `ivy-rich', only on GUI."
  (when (display-graphic-p)
    (let ((icon
           ;; for directories
           (if (file-directory-p candidate)
               (cond
                ;; for `tramp-mode'
                ((and (fboundp 'tramp-tramp-file-p)
                      (tramp-tramp-file-p default-directory))
                 (all-the-icons-octicon "file-directory"))
                ;; for symbolic links
                ((file-symlink-p candidate)
                 (all-the-icons-octicon "file-symlink-directory"))
                ;; for git submodules
                ((all-the-icons-dir-is-submodule candidate)
                 (all-the-icons-octicon "file-submodule"))
                ;; for version-controled by git
                ((file-exists-p (format "%s/.git" candidate))
                 (all-the-icons-octicon "repo"))
                ;; otherwise
                (t (let ((matcher (all-the-icons-match-to-alist candidate all-the-icons-dir-icon-alist)))
                     (apply (car matcher) (list (cadr matcher))))))
             ;; for files
             (all-the-icons-icon-for-file candidate))))
      (unless (symbolp icon)
        (propertize icon
                    'face `(:family ,(all-the-icons-icon-family icon) :height 1.1))))))
