README.org
** Company
補完には [[https://github.com/company-mode/company-mode][company-mode]] を用います．
各種設定は [[https://github.com/company-mode/company-mode/wiki/Switching-from-AC][Switching from AC]] を参考にしました．
=:bind= キーワードを使うとうまく読み込まないため， =:config= と =define-key= を利用しています

#+begin_src emacs-lisp
  (use-package company
    :hook (after-init . global-company-mode)
    :config
    (define-key company-active-map (kbd "<backtab>") 'company-select-previous)
    (define-key company-active-map (kbd "<tab>") 'company-complete-common-or-cycle)
    (define-key company-active-map (kbd "M-n") nil)
    (define-key company-active-map (kbd "M-p") nil)
    (define-key company-active-map (kbd "C-n") #'company-select-next)
    (define-key company-active-map (kbd "C-p") #'company-select-previous)
    (setq company-idle-delay 0)
    (setq company-selection-wrap-around t)
    (setq company-require-match 'never)
    :blackout t)
#+end_src

[[https://github.com/expez/company-quickhelp][company-quickhelp]] を用いて補完候補のドキュメントを読めるようにしておきます．

#+begin_src emacs-lisp
  (use-package company-quickhelp
    :if (window-system)
    :hook (company-mode . company-quickhelp-mode))
#+end_src

[[https://github.com/sebastiencs/company-box][company-box]] を用いて補完候補にアイコンを表示します．
デフォルトの設定のままだと，アイコンが大きく感じるので適当に調整をします．

#+begin_src emacs-lisp
  (use-package company-box
    :functions (all-the-icons-faicon all-the-icons-octicon all-the-icons-material all-the-icons-alltheicon)
    :if (and (window-system)
             (>= emacs-major-version 26))
    :init
    (defvar my-company-box-icons-all-the-icons
      `((Unknown       . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Text          . ,(all-the-icons-octicon    "file-text"                :height 0.9))
        (Method        . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Function      . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Constructor   . ,(all-the-icons-faicon     "cube"                     :height 0.9))
        (Field         . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Variable      . ,(all-the-icons-faicon     "cog"                      :height 0.9))
        (Class         . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Interface     . ,(all-the-icons-material   "share"                    :height 0.9))
        (Module        . ,(all-the-icons-alltheicon "less"                     :height 0.9))
        (Property      . ,(all-the-icons-faicon     "wrench"                   :height 0.9))
        (Unit          . ,(all-the-icons-material   "settings_system_daydream" :height 0.9))
        (Value         . ,(all-the-icons-material   "format_align_right"       :height 0.9))
        (Enum          . ,(all-the-icons-material   "content_copy"             :height 0.9))
        (Keyword       . ,(all-the-icons-material   "filter_center_focus"      :height 0.9))
        (Snippet       . ,(all-the-icons-material   "content_paste"            :height 0.9))
        (Color         . ,(all-the-icons-material   "palette"                  :height 0.9))
        (File          . ,(all-the-icons-faicon     "file"                     :height 0.9))
        (Reference     . ,(all-the-icons-material   "collections_bookmark"     :height 0.9))
        (Folder        . ,(all-the-icons-faicon     "folder"                   :height 0.9))
        (EnumMember    . ,(all-the-icons-material   "format_align_right"       :height 0.9))
        (Constant      . ,(all-the-icons-faicon     "square-o"                 :height 0.9))
        (Struct        . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Event         . ,(all-the-icons-faicon     "bolt"                     :height 0.9))
        (Operator      . ,(all-the-icons-material   "control_point"            :height 0.9))
        (TypeParameter . ,(all-the-icons-faicon     "cogs"                     :height 0.9))
        (Template      . ,(all-the-icons-material   "format_align_center"      :height 0.9))
        ))
    :hook (company-mode . company-box-mode)
    :custom
    (company-box-show-single-candidate t)
    (company-box-max-candidates 50)
    :config
    (setq company-box-backends-colors nil)
    (setq company-box-icons-alist 'my-company-box-icons-all-the-icons)
    :blackout t)
#+end_src

** Flycheck
文法チェックには [[https://www.flycheck.org/en/latest/][Flycheck]] を利用します．
後述の [[LSP][LSP]] を用いる場合には暴走するという情報があるので要確認です．

#+begin_src emacs-lisp
  (use-package flycheck
    :commands (flycheck-disable-checker)
    :hook (after-init . global-flycheck-mode)
    :custom
    (flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
#+end_src

エラー内容の表示に [[https://github.com/flycheck/flycheck-popup-tip][flycheck-popup-tip]] を利用します．

#+begin_src emacs-lisp
  (use-package flycheck-popup-tip
    :hook (flycheck-mode . flycheck-popup-tip-mode))
#+end_src

** LSP
いくつかの言語では Language Server Protocol を用いて補完・文法チェックを行います．
詳細は各言語の設定を参照してください．

ここでは [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]] を利用します．
補完には [[https://github.com/tigersoldier/company-lsp][company-lsp]] を，文法チェックには [[https://github.com/emacs-lsp/lsp-ui][lsp-ui/flycheck]] を利用します．

lsp-mode と flycheck を併用するにはカスタム変数 ~lsp-prefer-flymake~ を ~nil~ にセットします．
また flycheck-popup-tip を使用していると画面がうるさくなるのでカスタム変数 ~lsp-ui-sideline-enable~ を ~nil~ にセットし，
~lsp-ui-sideline-mode~ を無効化します．

大きいプロジェクトを開くと flycheck が重くなるという話もあるので場合によっては flymake を使うほうが良いかもしれません．

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp)
    :custom
    (lsp-prefer-flymake nil "Use `flycheck'."))

  (use-package company-lsp
    :demand t
    :after (company)
    :config
    (push 'company-lsp company-backends))

  (use-package lsp-ui
    :commands (lsp-ui-mode)
    :hook (lsp-mode . lsp-ui-mode)
    :bind (:map lsp-ui-mode-map
                ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
                ([remap xref-find-references] . lsp-ui-peek-find-references))
    :custom
    (lsp-ui-sideline-enable nil "Disable `lsp-ui-sideline-mode'.")
    :blackout t)
#+end_src

* Documents
** Org-mode
[[https://orgmode.org/][Org-mode]] の設定を行います．
前の方で ~(straight-use-package 'org)~ しているので ~use-feature~ マクロを用います．
Org-mode でのマークアップのため，electric pair の設定を適当に変更します．
また， ~electric-pair-mode~ により ~>~ が自動挿入されるのを禁止しています．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  ;;; for Org-mode: integrate with electric-pair-mode
  (defvar my-org-electric-pair-pairs
    '((?~ . ?~) (?= . ?=)))

  (defun my-org-electric-pair-inhibit (char)
    "Do not insert close `>'."
    (if (char-equal char ?<)
        t
      (electric-pair-default-inhibit char)))
  (defun my-org-electric-pair-mode ()
    "Use Org-mode with electric-pair-mode."
    (electric-pair-mode +1)
    (setq-local electric-pair-pairs (append electric-pair-pairs
                                            my-org-electric-pair-pairs))
    (setq-local electric-pair-text-pairs (append electric-pair-text-pairs
                                                 my-org-electric-pair-pairs))
    (setq-local electric-pair-inhibit-predicate #'my-org-electric-pair-inhibit))
#+end_src

HTML へのエクスポート時に CSS を分離するように ~org-html-htmlize-output-type~ を変更します．
Org-mode 9.2 より easy templete の代わりに =org-insert-structure-templete= (~C-c C-,~) を使うようになったようです．
easy templete を利用するには =(require 'org-temp)= する必要があります．

#+begin_src emacs-lisp
  (use-feature org
    :functions (my-org-electric-pair-mode)
    :hook (org-mode . my-org-electric-pair-mode)
    :custom
    (org-startup-indented t)
    (org-fontify-natively t)
    (org-html-htmlize-output-type 'css)
    :config
    (setq org-structure-template-alist (append '(("el" . "src emacs-lisp"))
                                               org-structure-template-alist)))
#+end_src

[[https://github.com/sabof/org-bullets][org-bullets]] で見た目を変更します．

#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode))
#+end_src

Github Flavored Markdown へのエクスポートのため [[https://github.com/larstvei/ox-gfm][ox-gfm]] をインストールします．

#+begin_src emacs-lisp
  (use-package ox-gfm
    :demand t
    :after (ox))
#+end_src

HTML へのエクスポートの際，コードハイライトに [[https://github.com/hniksic/emacs-htmlize][htmlize]] を利用します．

#+begin_src emacs-lisp
  (use-package htmlize
    :demand t
    :after (ox))
#+end_src

** Outline
Hydra を用いて outline-minor-mode を使いやすくします．

#+begin_src emacs-lisp
  (use-feature outline
    :hydra
    (hydra-outline
     (:hint nil)
     "
  ^Navigate^                ^Hide^         ^Show^         ^Edit^
  ^^^^^^^^^^^^----------------------------------------------------------------
  _u_: up                   _l_: leaves    _a_: all       _↑_: move up
  _n_: next visible         _t_: body      _e_: entry     _↓_: move down
  _p_: previous visible     _c_: entry     _k_: branches  _←_: promote
  _f_: forward same level   _d_: subtree   _i_: children  _→_: demote
  _b_: backward same level  _q_: sublevel  _s_: subtree
  ^ ^                       _o_: other     ^ ^            _z_: quit
  "
     ;; Navigate
     ("u" outline-up-heading)
     ("n" outline-next-visible-heading)
     ("p" outline-previous-visible-heading)
     ("f" outline-forward-same-level)
     ("b" outline-backward-same-level)
     ;; Hide
     ("l" outline-hide-leaves)
     ("t" outline-hide-body)
     ("c" outline-hide-entry)
     ("d" outline-hide-subtree)
     ("q" outline-hide-sublevels)
     ("o" outline-hide-other)
     ;; Show
     ("a" outline-show-all)
     ("e" outline-show-entry)
     ("k" outline-show-branches)
     ("i" outline-show-children)
     ("s" outline-show-subtree)
     ;; Edit
     ("<up>" outline-move-subtree-up)
     ("<down>" outline-move-subtree-down)
     ("<left>" outline-promote)
     ("<right>" outline-demote)
     ;; quit
     ("z" nil))
    :bind (:map outline-minor-mode-map
                ("C-c #" . hydra-outline/body)))
#+end_src

** TeX/LaTeX
*** AUCTeX
TeX 文書の作成には [[https://www.gnu.org/software/auctex/][AUCTeX]] を利用します．

#+begin_src emacs-lisp
  (straight-use-package 'auctex)
#+end_src

