elisp/utility.el

;;; for Org-mode: integrate with electric-pair-mode
(defvar my-org-electric-pair-pairs
  '((?~ . ?~) (?= . ?=)))

(defun my-org-electric-pair-inhibit (char)
  "Do not insert close `>'."
  (if (char-equal char ?<)
      t
    (electric-pair-default-inhibit char)))
(defun my-org-electric-pair-mode ()
  "Use Org-mode with electric-pair-mode."
  (electric-pair-mode +1)
  (setq-local electric-pair-pairs (append electric-pair-pairs
                                          my-org-electric-pair-pairs))
  (setq-local electric-pair-text-pairs (append electric-pair-text-pairs
                                               my-org-electric-pair-pairs))
  (setq-local electric-pair-inhibit-predicate #'my-org-electric-pair-inhibit))

;;; For Ebib
