README.org
*** Ebib
文献管理には [[https://github.com/joostkremers/ebib][Ebib]] を利用します．
基本的には ~~/texmf/bibtex/bib~ 以下の ~.bib~ ファイルに文献情報を記述していきます．
論文の PDF は ~~/BibFile~ 以下に適切に配置し，Dropbox 等で同期します．

Index buffer での基本操作は次の通りです．

|-----+-------------------------|
| Key | Action                  |
|-----+-------------------------|
| ~o~ | Open .bib file          |
| ~f~ | Open file               |
| ~u~ | Browse URL              |
| ~a~ | Add entry               |
| ~e~ | Edit entry              |
| ~E~ | Edit entry-key          |
| ~m~ | Mark current entry      |
| ~M~ | Mark all entries        |
| ~x~ | Export marked entries   |
| ~!~ | Auto-generate entry-key |
| ~s~ | Save                    |
| ~z~ | Pause                   |
| ~q~ | Quit                    |
|-----+-------------------------|

Entry buffer での基本操作は次のとおりです．

|-----+-----------------------|
| Key | Action                |
|-----+-----------------------|
| ~a~ | Add field             |
| ~e~ | Edit field            |
| ~m~ | Edit multiline buffer |
| ~d~ | Delete field          |
| ~q~ | Quit                  |
|-----+-----------------------|

PDF 閲覧のために次のような関数を定義しておきます．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  ;;; For Ebib
  (defun my-ebib-name-transform-function (key)
    "Serach file of the form
         SEARCH-DIRS/FIRST-AUTHOR/ENTRY-KEY"
    (format "%s/%s"
            (substring key (string-match "[A-Za-z]+" key) (match-end 0))
            (replace-regexp-in-string ":" "" key)))
#+end_src

index buffer で ~K a~ を押下することで直接 keywords を追加できます．
マークした enrtry 全てに keywords を追加することも可能です．
~RET~ では keyword の補完になるので， ~C-M-j~ (=ivy-immediate-done= ?) で編集画面から抜け出すことができます．

#+begin_src emacs-lisp
  (use-package ebib
    :functions (my-ebib-name-transform-function)
    :preface
    (defvar my-ebib-keywords-file (expand-file-name "~/texmf/emacs/ebib-keywords.txt")
      "You put here `ebib-keywords.txt'.")
    :commands (ebib)
    :bind (:map ebib-multiline-mode-map
                ("C-c C-c" . ebib-quit-multiline-buffer-and-save))
    :custom
    (ebib-bitex-dialect 'BibTeX)
    ;; Preload database
    (ebib-preload-bib-files '("~/texmf/bibtex/bib/articles.bib"
                              "~/texmf/bibtex/bib/books.bib"
                              "~/texmf/bibtex/bib/others.bib"))
    ;; Extra fields
    (ebib-extra-fields '((BibTeX "crossref"
                                 "annote"
                                 "keywords"
                                 "doi"
                                 "shortjournal"
                                 "archivePrefix" "eprint" "primaryClass"
                                 "MRCLASS" "MRNUMBER"
                                 "file")
                         (biblatex "crossref"
                                   "annotation"
                                   "keywords"
                                   "shortjournal"
                                   "archivePrefix" "primaryClass"
                                   "MRCLASS" "MRNUMBER"
                                   "file")))
    ;; Files
    (ebib-file-search-dirs '("~/BibFile/Papers"
                             "~/BibFile/Books"
                             "~/BibFile/Proceedings"))
    (ebib-name-transform-function #'my-ebib-name-transform-function)
    (ebib-file-associations (cond ((eq system-type 'darwin) '(("pdf" . "open") ("ps" . "open")))
                                  (t '(("pdf" . "xpdf") ("ps" . "gv")))))
    ;; Keywords
    (ebib-keywords-use-only-file t)
    (ebib-keywords-field-keep-sorted t)
    (ebib-keywords-file-save-on-exit 'always)
    (ebib-keywords-file my-ebib-keywords-file))
#+end_src

** Markdown
Markdown パーサとして [[https://github.com/markedjs/marked][marked]] を利用します．
インストールするには =npm install -g marked= とします．

electric pair の設定を適宜追加します．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (defvar my-markdown-electric-pair-pairs
    '((?` . ?`)
      (?* . ?*)
      (?_ . ?_)))

  (defun my-markdown-electric-pair-mode ()
    "Use `markdown-mode' with `electric-pair-mode'."
    (electric-pair-local-mode +1)
    (setq-local electric-pair-pairs (append electric-pair-pairs
                                            my-markdown-electric-pair-pairs)))
#+end_src

ファイル名が ~README.md~ と一致する場合 =gfm-mode= で開きます．
それ以外で拡張子が ~.md~ の場合は =markdown-mode= で開きます．

#+begin_src emacs-lisp
  (use-package markdown-mode
    :defines (my-markdown-electric-pair-pairs)
    :functions (my-markdown-electric-pair-mode)
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode))
    :hook ((gfm-mode markdown-mode) . my-markdown-electric-pair-mode)
    :init
    (setq markdown-command "marked")
    :custom
    (markdown-fontify-code-blocks-natively t))
#+end_src

Org-mode のように =C-c '= でコードブロックを編集するには [[https://github.com/Fanael/edit-indirect/][edit-indirect]] パッケージが必要なようです．

よく使うキーバインドについて，次のようにまとめておきます．

| key           | action                        |
|---------------+-------------------------------|
| =C-c C-l=     | Insert links                  |
| =C-c C-s i=   | Markup (italic)               |
| =C-c C-s b=   | Markup (bold)                 |
| =C-c C-s c=   | Markup (inline code)          |
| =C-c C-s k=   | Markup (<kbd> tag)            |
| =C-c C-s q=   | Markup (blockquote)           |
| =C-c C-s h=   | Insert a heading              |
| =C-c C-s <n>= | Insert a heading of level <n> |
| =C-c C-s f=   | Insert footnotes              |

=markdown-command= を利用して HTML へ変換，プレビュー等を行えます．

| key         | action                                |
|-------------+---------------------------------------|
| =C-c C-c m= | Output to ~*markdown-output*~ buffer  |
| =C-c C-c p= | Output to browser via temporary file  |
| =C-c C-c e= | Output to ~basename.html~             |
| =C-c C-c v= | Output to browser via ~basename.html~ |

サブツリーの移動については次のようなキーバインドが用意されています．

| key           | action    |
|---------------+-----------|
| =C-c <up>=    | Move up   |
| =C-c <down>=  | Move down |
| =C-c <right>= | Demote    |
| =C-c <left>=  | Promote   |

* Programming Languages
** C/C++
Language Server として [[https://github.com/MaskRay/ccls][ccls]] を利用します．
ccls のインストール方法については [[https://github.com/MaskRay/ccls/wiki/Build][Wiki/Build]] を参照してください．

macOS の場合は homebrew からインストールできます．

#+begin_src sh :tangle no
  brew tap twlz0ne/homebrew-ccls
  brew install ccls
#+end_src

#+begin_src emacs-lisp
  (use-package ccls
    :hook ((c-mode c++-mode objc-mode) . (lambda ()
                                           (require 'ccls)
                                           (lsp)))
    :config
    (setq ccls-sem-highlight-method 'font-lock))

  (use-package modern-cpp-font-lock
    :commands (modern-c++-font-lock-mode)
    :hook (c++-mode-hook . modern-c++-font-lock-mode)
    :blackout t)
#+end_src

** Emacs Lisp
flycheck の emacs-lisp-checkdoc の警告はあまり有益に思えないため無効化しています．
有効化するには ~C-u M-x flycheck-disable-checker~ とします．

#+begin_src emacs-lisp
  (use-feature elisp-mode
    :blackout (lisp-interaction-mode . "Lisp-Interaction"))
#+end_src

** Ocaml
OCaml の編集には [[https://github.com/ocaml/tuareg][tuareg-mode]] を利用します．
[[https://github.com/freebroccolo/ocaml-language-server][ocaml-language-server]] と lsp-mode を利用して補完等を行います．
インストールは

 #+begin_src sh :tangle no
   ~$ npm install -g ocaml-language-server
   ~$ opam install merlin               # if needed
 #+end_src

とします．
キチンと使っていないので後で加筆するかもしれません．

[[https://khady.info/emacs-ocaml-lsp.html][このブログ]]によれば merlin と language server が統合されたようなので近々設定を書き換えるかもしれません．

#+begin_src emacs-lisp
  (use-package tuareg
    :hook (tuareg-mode . lsp))
#+end_src

** Python
Emacs 同梱の ~python.el~ を利用します．
~python-mode.el~ ではないことに注意してください．

~python3~ がインストールされている場合， ~python2~ ではなく ~python3~ を使うようにします．
またインデントには空白 4 文字を用いるようにします．

LSP ([[https://github.com/palantir/python-language-server][pyls]]) を利用して補完・文法チェックを行います．
インストールは

#+begin_src sh :tangle no
  ~$ pip install 'python-language-server[all]'
#+end_src

とします．

#+begin_src emacs-lisp
  (use-feature python
    :mode ("\\.py\\'" . python-mode)
    :interpreter ("python" . python-mode)
    :hook (python-mode . (lambda ()
                           (lsp)
                           (setq-local indent-tabs-mode nil)
                           (setq-local tab-width 4)))
    :config
    (when (executable-find "python3")
      ;; use python3 if it exists
      (setq python-shell-interpreter "python3")))
#+end_src

* Appearance
** Color theme
[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] の ~doom-dracula~ テーマを利用します．

#+begin_src emacs-lisp
  (use-package doom-themes
    :demand t
    :custom
    (doom-themes-enable-bold t)
    (doom-themes-enable-italic t)
    (doom-neotree-file-icons t)
    :config
    (load-theme 'doom-dracula t)
    (doom-themes-visual-bell-config)
    (doom-themes-neotree-config)
    (doom-themes-org-config))
#+end_src

またモードラインを [[https://github.com/seagle0128/doom-modeline][doom-modeline]] でカスタマイズします．

#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-buffer-file-name-style 'truncate-upto-project)
    (doom-modeline-icon t)
    (doom-modeline-major-mode-color-icon t)
    (find-file-visit-truename t)
    :config
    (setq doom-modeline-mu4e nil)
    (setq doom-modeline-irc nil))
#+end_src

** Frame
ツールバー等，特に必要のないものは表示しないようにします．

#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (size-indication-mode +1)
  (setq frame-title-format "%f")
#+end_src

Emacs 26 以上を使用している場合 ~display-line-numbers-mode~ を利用します．

#+begin_src emacs-lisp
  (when (version<= "26.0.50" emacs-version)
    (add-hook 'prog-mode-hook #'display-line-numbers-mode))
#+end_src

Emacs 起動時にフレームを最大化します．

#+begin_src emacs-lisp
  (set-frame-parameter nil 'fullscreen 'maximized)
#+end_src

** Font
フォントに関しては，例えば，次のように ~local-conf.el~ に記述します．

#+begin_src emacs-lisp :tangle no
  (set-face-attribute 'default nil
                      :family "Source Han Code JP"
                      :height 140)
#+end_src
* Global keybindings
global-map のキーバインドを次のように変更します．

#+begin_src emacs-lisp
  (define-key global-map (kbd "C-m") #'newline-and-indent)
  (define-key global-map (kbd "C-2") #'set-mark-command)
  (define-key global-map (kbd "C-t") #'other-window)
  (define-key global-map (kbd "C-;") #'comment-line)
  (define-key global-map (kbd "C-v") #'hydra-navi/body)
#+end_src

また ~C-h~ を ~DEL~ と入れ替えます．
=help-for-help= は ~C-x ?~ にバインドします．

#+begin_src emacs-lisp
  (define-key key-translation-map (kbd "C-h") (kbd "DEL"))
  (define-key global-map (kbd "C-x ?") 'help-for-help)
#+end_src
* Local configuration
** Overview
~.emacs.d/local-conf.el~ にマシン・環境ごとの設定を記述します．
また Customize で設定したカスタム変数等も ~local-conf.el~ に記述されます．

#+begin_src emacs-lisp
  (setq custom-file my-local-config-file)
  (load my-local-config-file t)
#+end_src

** For EMP (Emacs Mac Port)
[[https://github.com/railwaycat/homebrew-emacsmacport][EMP 版の Emacs]] では NS 版のものと挙動が異なります．
オプションキーをメタキーとして使うために次を記述します．

#+begin_src emacs-lisp :tangle no
  (setq mac-option-modifier 'meta)
#+end_src

** SINGULAR
[[https://www.singular.uni-kl.de/][SINGULAR]] は代数計算ソフトの一つです．
SINGULAR を Emacs 上で利用するには，インストール後に次のような記述を追加します．
ここで ~<singular-emacs-home-directory>~ は，例えば macOS に Homebrew を利用してバージョン 4.1.1_5 を
インストールした場合 ~/usr/local/Cellar/singular/4.1.1_5/share/singular/emacs~ になります．

記述を追加後 =M-x singular= で Emacs 上で SINGULAR が利用できます．
詳しくは [[https://www.singular.uni-kl.de/Manual/latest/sing_23.htm#SEC30][Online Manual - 3.2.2 Running SINGULAR under Emacs]] を参照してください．

#+begin_src emacs-lisp :tangle no
  (add-to-list 'load-path "<singular-emacs-home-directory>")
  (autoload 'singular "singular"
    "Start Singular using default value." t)
  (autoload 'singular-other "singular"
    "Ask for arguments and start Singular." t)
#+end_src

** Macaulay2
[[http://www2.macaulay2.com/Macaulay2/][Macaulay2]] は主に代数幾何学および可換環論のための代数計算ソフトの一つです．

=setup()= あるいは =setupEmacs()= を =Macaulay2= 内で実行すると PATH の追加および Emacs 関連のファイルの生成が行われます．
特にホームディレクトリ直下に ~.emacs-Macaulay2~ ができるはずです．

Macaulay2 を Emacs で使うにはこのファイルをロードすれば良いです．
また M2-comint-mode で ~C-<return>~ で，式を実行せず改行できるようにしておきます．

#+begin_src emacs-lisp :tangle no
  (load "~/.emacs-Macaulay2" t)
  (with-eval-after-load "M2"
    (define-key M2-comint-mode-map (kbd "C-<return>") #'M2-newline-and-indent))
#+end_src

* License
本設定ファイルは [[https://www.gnu.org/licenses/gpl.html][GNU 一般公衆ライセンス]] (バージョン 3 または以降の任意のバージョン) で公開しています．

また [[https://mahito1594.github.io/dotemacs/][GitHub Page]] の表示に [[https://orgmode.org/worg/style/worg.css][~worg.css~]] を利用しています．
~worg.css~ は GNU 一般公衆ライセンス (バージョン 3 または以降の任意のバージョン) で公開されています．

#+begin_src emacs-lisp :tangle ./elisp/utility.el
  (provide 'utility)
  ;;; utility.el ends here
#+end_src

#+begin_src emacs-lisp
  (provide 'my-init)
  ;;; my-init.el ends here
#+end_src

# Local Variables:
# org-babel-default-header-args: ((:session . "none")
#                                 (:results . "replace")
#                                 (:exports . "code")
#                                 (:cache . "no")
#                                 (:noweb . "no")
#                                 (:hlines . "no")
#                                 (:tangle . "./elisp/my-init.el"))
# End:
